[
    {
        "image": "https://i.ibb.co.com/BHLrvJHQ/Spotify-Music.jpg",
        "title": "Spotify Music",
        "companyName": "Spotify AB",
        "id": 1,
        "description": "Spotify Music is one of the world’s leading audio streaming platforms that offers millions of songs, albums, and podcasts from artists around the globe. It lets you explore diverse genres, build playlists, and listen to music that fits every mood or activity. Spotify’s smart algorithm learns your taste and provides daily mixes and weekly discoveries. You can download your favorite songs for offline listening, follow artists, and share your playlists with friends. From morning motivation to late-night relaxation, Spotify ensures you always have the perfect soundtrack wherever you go. ",
        "description2": "Spotify Music is one of the world’s leading audio streaming platforms, giving users access to millions of songs, albums, and podcasts from artists across every genre imaginable. It allows listeners to create their own playlists, follow favorite artists, and discover new music through smart AI-based recommendations. With both free and premium plans, Spotify offers offline downloads, ad-free streaming, and high-quality sound options. Its user-friendly interface makes it easy to navigate, and the “Discover Weekly” and “Release Radar” features keep the experience fresh every week. Spotify also supports collaborative playlists, letting friends share and edit song lists together. Whether you’re working, studying, or relaxing, the app’s mood-based playlists set the right tone. Cross-platform support ensures you can seamlessly switch from your phone to your desktop or even your car. Spotify’s global reach and personalized music experience make it an essential app for any music lover who wants a limitless and social listening journey.",
        "size": 248,
        "reviews": 52,
        "ratingAvg": 4.5,
        "downloads": 10,
        "ratings": [
            {
                "name": "1 star",
                "count": 200000
            },
            {
                "name": "2 star",
                "count": 350000
            },
            {
                "name": "3 star",
                "count": 900000
            },
            {
                "name": "4 star",
                "count": 3200000
            },
            {
                "name": "5 star",
                "count": 10700000
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/Xkvf1yV3/TikTok.jpg",
        "title": "TikTok",
        "companyName": "ByteDance",
        "id": 2,
        "description": "TikTok is the world’s fastest-growing short video platform where creativity meets fun. Users can record, edit, and share 15 to 60-second videos enhanced with background music, filters, and special effects. The app’s personalized feed is powered by a smart algorithm that learns what you love watching. Whether you’re exploring dance trends, funny skits, or lifestyle hacks, TikTok connects creators and audiences like never before. Go live, interact with fans, or collaborate with others — TikTok is the stage for your imagination.",
        "description2": "TikTok has revolutionized short-form video content, empowering users to create, watch, and share engaging clips up to 10 minutes long. Its smart algorithm quickly learns what you love, providing a never-ending stream of entertainment tailored to your preferences. From dance challenges and comedy sketches to tutorials and storytelling, TikTok offers limitless creative expression. The app includes powerful editing tools, filters, effects, and music options that help even beginners make professional-looking videos. Creators can collaborate through duets, stitches, and trends that spark viral moments worldwide. TikTok also supports live streaming, shopping, and creator monetization, making it a hub for both fun and opportunity. Its global community thrives on diversity, creativity, and humor. Whether you’re there to relax, get inspired, or build a following, TikTok keeps you entertained for hours with constantly fresh, personalized content.",
        "size": 169,
        "reviews": 20,
        "ratingAvg": 4.4,
        "downloads": 20,
        "ratings": [
            {
                "name": "1 star",
                "count": 400000
            },
            {
                "name": "2 star",
                "count": 500000
            },
            {
                "name": "3 star",
                "count": 1000000
            },
            {
                "name": "4 star",
                "count": 5000000
            },
            {
                "name": "5 star",
                "count": 13100000
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/bjvC4s5L/Instagram.jpg",
        "title": "Instagram",
        "companyName": "Meta Platforms, Inc.",
        "id": 3,
        "description": "Instagram is the go-to social media platform for sharing photos, videos, and stories. With Reels, IGTV, and Live features, it lets you express your creativity in countless ways. Connect with friends, follow celebrities, or explore trending content through the Discover tab. Instagram is also a hub for influencers and businesses to promote brands and reach a global audience. Its clean design, powerful messaging features, and creative tools make it more than an app — it’s your digital lifestyle companion.",
        "description2": "Instagram is a social media powerhouse designed for sharing photos, videos, and stories with friends, followers, and global audiences. It allows users to express themselves creatively through filters, reels, and visually engaging posts. Businesses and influencers use Instagram to connect with audiences, promote brands, and drive engagement through likes, comments, and DMs. The Explore tab introduces new creators and trends tailored to your interests, while Stories and Reels make short-form content fun and interactive. Instagram also supports shopping features, allowing users to browse and buy products directly within the app. With regular updates introducing new creative tools, it remains one of the most popular apps for visual storytelling. Users can also manage professional accounts for analytics, ad management, and audience insights. Whether you’re capturing daily life or growing a brand, Instagram empowers connection through creativity, simplicity, and authenticity.",
        "size": 225,
        "reviews": 18,
        "ratingAvg": 4.3,
        "downloads": 25,
        "ratings": [
            {
                "name": "1 star",
                "count": 500000
            },
            {
                "name": "2 star",
                "count": 700000
            },
            {
                "name": "3 star",
                "count": 1200000
            },
            {
                "name": "4 star",
                "count": 4200000
            },
            {
                "name": "5 star",
                "count": 11600000
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/vC7ZqWqk/Facebook.jpg",
        "title": "Facebook",
        "companyName": "Meta Platforms, Inc.",
        "id": 4,
        "description": "Facebook connects billions of people worldwide through posts, stories, and communities. Share life moments, photos, and ideas with family and friends. You can join groups, follow pages, and explore trending videos through Facebook Watch. The integrated Marketplace lets you buy and sell items locally, while Facebook Events help organize meetups and celebrations. With Messenger integration, Facebook is more than a social app — it’s a complete ecosystem for communication, connection, and discovery.",
        "description2": "Facebook remains one of the most influential social networking platforms, connecting billions of users worldwide. It allows people to share updates, photos, videos, and life moments while staying in touch with friends, family, and communities. The app’s Groups and Marketplace features make it useful for both social interaction and local business opportunities. Facebook’s algorithm curates a personalized feed, keeping you updated with relevant news and posts. It supports live streaming, gaming, events, and professional networking, making it an all-in-one communication hub. The Messenger integration ensures instant chatting, voice, and video calls. For creators and businesses, Facebook provides advanced marketing tools and insights to grow audiences. Privacy settings allow control over what’s shared and who sees it. Constant updates and innovations ensure that Facebook continues to adapt to modern social trends, keeping it a leading choice for staying connected and informed.",
        "size": 130,
        "reviews": 22,
        "ratingAvg": 4.1,
        "downloads": 50,
        "ratings": [
            {
                "name": "1 star",
                "count": 800000
            },
            {
                "name": "2 star",
                "count": 1000000
            },
            {
                "name": "3 star",
                "count": 2000000
            },
            {
                "name": "4 star",
                "count": 6000000
            },
            {
                "name": "5 star",
                "count": 12200000
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/0RLqs2vP/WhatsApp.webp",
        "title": "WhatsApp Messenger",
        "companyName": "Meta Platforms, Inc.",
        "id": 5,
        "description": "WhatsApp Messenger is a free messaging app that allows you to send text, voice, and video messages instantly. With end-to-end encryption, your conversations remain private and secure. You can create group chats, share media files, and make high-quality voice or video calls anywhere in the world. WhatsApp Web also allows you to continue chats from your computer. Its reliability, simplicity, and privacy make it one of the most trusted communication tools globally.",
        "description2": "WhatsApp Messenger is a free and secure communication app that lets users send text messages, make voice and video calls, and share media instantly with anyone worldwide. Built with end-to-end encryption, it ensures every conversation stays private and protected. WhatsApp supports group chats, status updates, and document sharing, making it ideal for both personal and business communication. The app works seamlessly across mobile and web, syncing messages in real time. With voice notes, emojis, and stickers, chats feel more expressive and human. The Business version helps brands connect with customers through verified profiles and automated responses. WhatsApp also enables calling even on slow internet, maintaining clear quality. Its lightweight design and reliability make it a favorite for billions. Whether keeping in touch with loved ones or coordinating work, WhatsApp delivers fast, secure, and dependable messaging for everyone.",
        "size": 120,
        "reviews": 19,
        "ratingAvg": 4.6,
        "downloads": 50,
        "ratings": [
            {
                "name": "1 star",
                "count": 200000
            },
            {
                "name": "2 star",
                "count": 300000
            },
            {
                "name": "3 star",
                "count": 700000
            },
            {
                "name": "4 star",
                "count": 4000000
            },
            {
                "name": "5 star",
                "count": 14000000
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/0VjKgcmm/YouTube.jpg",
        "title": "YouTube",
        "companyName": "Google LLC",
        "id": 6,
        "description": "YouTube is the world’s largest video-sharing platform where billions of people watch, upload, and share content every day. From music videos and vlogs to tutorials and live streams, YouTube covers every topic imaginable. Subscribe to your favorite channels, leave comments, and explore trending content. With YouTube Premium, enjoy ad-free viewing and offline playback. It’s not just entertainment — it’s a platform for learning, creativity, and global connection.",
        "description2": "YouTube is the largest video-sharing platform in the world, allowing billions of users to watch, share, and create videos across every topic imaginable. From music and gaming to education and technology, YouTube is home to diverse content made by creators from around the globe. The app offers personalized recommendations, live streaming, and channel subscriptions so users never miss new uploads from their favorites. YouTube Premium unlocks ad-free viewing, offline downloads, and background playback for uninterrupted entertainment. The comment section fosters community engagement, letting fans connect directly with creators. With features like Shorts and YouTube Live, it continues to evolve with modern content trends. The search algorithm is powerful, helping you find exactly what you’re looking for in seconds. Whether you want tutorials, entertainment, or motivation, YouTube delivers it all in one dynamic platform that keeps evolving with every update." ,
        "size": 233,
        "reviews": 25,
        "ratingAvg": 4.7,
        "downloads": 100,
        "ratings": [
            {
                "name": "1 star",
                "count": 300000
            },
            {
                "name": "2 star",
                "count": 400000
            },
            {
                "name": "3 star",
                "count": 1000000
            },
            {
                "name": "4 star",
                "count": 6000000
            },
            {
                "name": "5 star",
                "count": 17300000
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/mFvPjyxv/Gmail.jpg",
        "title": "Gmail",
        "companyName": "Google LLC",
        "id": 7,
        "description": "Gmail is a secure and efficient email platform designed to help you communicate and stay organized. It features smart inbox sorting, spam filtering, and real-time notifications. With integrated Google Meet and Chat, you can collaborate seamlessly with colleagues and friends. Gmail also offers generous storage and powerful search tools to find any message quickly. Whether for work or personal use, Gmail keeps your communication fast, simple, and safe.",
        "description2": "Gmail is a powerful and secure email service developed by Google, offering seamless communication and advanced organization tools. It provides free storage, spam protection, and smart inbox sorting that categorizes messages automatically into Primary, Social, and Promotions tabs. The app supports multi-account login, allowing users to manage personal and work emails in one place. Gmail’s search functionality is fast and accurate, helping users find messages instantly. It integrates with Google Workspace apps like Drive, Meet, and Calendar for productivity on the go. With AI-based Smart Reply and Smart Compose, writing emails becomes quicker and easier. Security features like two-step verification and phishing alerts ensure privacy. The app also works offline, letting users read and draft emails without internet access. Whether for business or personal communication, Gmail remains the gold standard for reliable, intelligent, and efficient emailing worldwide.",
        "size": 305,
        "reviews": 12,
        "ratingAvg": 4.4,
        "downloads": 90,
        "ratings": [
            {
                "name": "1 star",
                "count": 150000
            },
            {
                "name": "2 star",
                "count": 250000
            },
            {
                "name": "3 star",
                "count": 800000
            },
            {
                "name": "4 star",
                "count": 3200000
            },
            {
                "name": "5 star",
                "count": 7500000
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/TqxhDtZ8/Telegram.png",
        "title": "Telegram",
        "companyName": "Telegram FZ-LLC",
        "id": 8,
        "description": "Telegram is a cloud-based instant messaging app that emphasizes speed and security. It supports large group chats, file sharing up to 2GB, and secret chats with self-destruct timers. Telegram’s sleek design and customizable interface make it a favorite among tech users. With bots, channels, and cross-platform sync, it’s not just a messenger — it’s a complete social ecosystem built around privacy and innovation.",
        "description2": "Telegram is a powerful cloud-based messaging app known for its speed, security, and versatility. It supports unlimited cloud storage, meaning users can access messages, photos, and files from any device without losing data. Telegram allows large group chats, channels with thousands of subscribers, and bots that automate tasks or provide real-time updates. Messages are encrypted and can self-destruct for extra privacy. The app includes rich media sharing, custom stickers, and themes for personalization. Unlike traditional messengers, Telegram focuses on speed and reliability, even in low connectivity areas. The interface is clean, modern, and ad-free, creating a distraction-free chatting experience. It’s also popular among developers for its open API and bot integration. Whether for personal use, community building, or productivity, Telegram combines simplicity with advanced features, offering a secure and efficient communication platform.",
        "size": 270,
        "reviews": 9,
        "ratingAvg": 4.5,
        "downloads": 25,
        "ratings": [
            {
                "name": "1 star",
                "count": 120000
            },
            {
                "name": "2 star",
                "count": 200000
            },
            {
                "name": "3 star",
                "count": 500000
            },
            {
                "name": "4 star",
                "count": 2300000
            },
            {
                "name": "5 star",
                "count": 5900000
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/zTvftynG/Netflix.jpg",
        "title": "Netflix",
        "companyName": "Netflix, Inc.",
        "id": 9,
        "description": "Netflix is a global streaming service offering thousands of movies, TV shows, and original series in high-definition. Whether you love action, romance, documentaries, or anime, Netflix has something for every taste. You can download episodes for offline watching and enjoy personalized recommendations. Its adaptive streaming ensures smooth playback even with slow internet. With multi-profile support, everyone in your family gets a personalized experience. Netflix is a global streaming service offering thousands of movies, TV shows, and original series in high-definition. Whether you love action, romance, documentaries, or anime, Netflix has something for every taste. You can download episodes for offline watching and enjoy personalized recommendations. Its adaptive streaming ensures smooth playback even with slow internet. With multi-profile support, everyone in your family gets a personalized experience.",
        "description2": "Netflix is the world’s most popular streaming platform, offering a massive collection of movies, TV series, documentaries, and exclusive originals in multiple languages. With personalized recommendations based on viewing habits, it ensures every user finds content tailored to their taste. The app supports offline downloads, multiple user profiles, and parental controls, making it suitable for families and individuals alike. Netflix Originals like Stranger Things, Money Heist, and The Witcher have set new standards for entertainment worldwide. The interface is sleek and intuitive, with smart previews and trailers that enhance discovery. Its adaptive streaming technology ensures smooth playback even with limited internet speed. Users can switch devices seamlessly, continuing their show right where they left off. From high-quality HD to 4K Ultra HD, Netflix delivers cinematic experiences on every screen. Whether you love drama, thrillers, comedy, or anime, Netflix brings endless entertainment without interruption.",
        "size": 459,
        "reviews": 15,
        "ratingAvg": 4.6,
        "downloads": 50,
        "ratings": [
            {
                "name": "1 star",
                "count": 300000
            },
            {
                "name": "2 star",
                "count": 400000
            },
            {
                "name": "3 star",
                "count": 700000
            },
            {
                "name": "4 star",
                "count": 4000000
            },
            {
                "name": "5 star",
                "count": 9600000
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/KpqrRmdP/Snapchat.jpg",
        "title": "Snapchat",
        "companyName": "Snap Inc.",
        "id": 10,
        "description": "Snapchat is a fast and fun messaging app that lets you share moments instantly with friends through snaps and stories. Capture photos, add filters, and chat with creative Bitmojis. Its disappearing message system keeps conversations light and private. Discover trending news, shows, and AR lenses that turn everyday life into an adventure. Snapchat’s focus on privacy and creativity makes it a favorite among the youth generation.",
        "description2": "Snapchat is a fun and fast multimedia messaging app focused on sharing moments that disappear after being viewed. It lets users send photos, videos, and text messages called “Snaps,” which vanish within seconds, keeping conversations light and spontaneous. With features like Stories, Spotlight, and Snap Map, users can explore global trends or connect with friends nearby. Snapchat’s lenses and filters offer endless creativity, transforming faces, scenes, and moods instantly. The app also supports Bitmoji avatars, making conversations more personal and expressive. Snapchat’s Discover tab features entertainment, news, and creator content for quick daily updates. It maintains privacy and authenticity by emphasizing real-time sharing over curated posts. Whether chatting privately or exploring fun AR filters, Snapchat provides a unique way to communicate, explore, and express yourself in a playful and genuine way that keeps users coming back every day.",
        "size": 275,
        "reviews": 8,
        "ratingAvg": 4.3,
        "downloads": 20,
        "ratings": [
            {
                "name": "1 star",
                "count": 100000
            },
            {
                "name": "2 star",
                "count": 200000
            },
            {
                "name": "3 star",
                "count": 400000
            },
            {
                "name": "4 star",
                "count": 2000000
            },
            {
                "name": "5 star",
                "count": 5300000
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/rKLjZ64L/Canva.jpg",
        "title": "Canva",
        "companyName": "Canva Pty Ltd",
        "id": 11,
        "description": "Canva is a powerful online design tool that allows anyone to create stunning visuals with ease. From social media posts and presentations to posters and business cards, Canva provides thousands of templates to choose from. The drag-and-drop interface makes designing effortless, even for beginners. You can collaborate with team members, upload your brand assets, and export your designs in multiple formats. With Canva Pro, you unlock advanced tools like background remover and brand kits for professional branding.",
        "description2": "Canva is a versatile graphic design app that empowers anyone to create stunning visuals without needing professional design skills. With thousands of customizable templates, users can design social media posts, logos, presentations, posters, and more in minutes. The drag-and-drop interface makes editing effortless, while its massive library of fonts, icons, and stock photos enhances creativity. Canva also supports collaboration, allowing teams to co-edit projects in real time. The app’s Magic Resize and AI design tools simplify layout adjustments across platforms. Whether you’re a student, marketer, or entrepreneur, Canva helps you bring ideas to life with style. It also offers a Pro plan featuring brand kits, premium elements, and background removal tools for advanced editing. From Instagram posts to business flyers, Canva transforms complex design tasks into a fun, accessible, and inspiring creative experience.",
        "size": 365,
        "reviews": 52,
        "ratingAvg": 4.8,
        "downloads": 35,
        "ratings": [
            {
                "name": "1 star",
                "count": 80000
            },
            {
                "name": "2 star",
                "count": 130000
            },
            {
                "name": "3 star",
                "count": 300000
            },
            {
                "name": "4 star",
                "count": 1200000
            },
            {
                "name": "5 star",
                "count": 3500000
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/n5R46Pw/Duolingo.webp",
        "title": "Duolingo",
        "companyName": "Duolingo Inc.",
        "id": 12,
        "description": "Duolingo makes language learning fun and addictive. Through interactive lessons, challenges, and rewards, it helps users learn over 30 languages including Spanish, French, German, and Japanese. Its gamified structure keeps you motivated, while smart AI adapts the lessons to your skill level. You can track your daily progress, compete with friends, and earn streaks for consistency. Duolingo’s mascot Duo ensures you stay on track in your journey to mastering a new language.",
        "description2": "Duolingo is a fun, engaging, and interactive language-learning app that helps users master new languages through short, gamified lessons. Its bite-sized exercises focus on speaking, listening, reading, and writing, making learning both effective and entertaining. The app supports dozens of languages, including Spanish, French, German, Japanese, and English. Duolingo’s friendly mascot, Duo the owl, keeps learners motivated through daily streaks, XP points, and rewards. Its AI-based feedback system adapts lessons to your learning speed and mistakes. Users can track progress, review weak areas, and participate in global leaderboards for extra motivation. Duolingo also offers pronunciation practice and conversation challenges for real-world fluency. With its colorful interface, fun quizzes, and supportive community, it’s perfect for beginners and language enthusiasts alike. Whether learning for travel, school, or career, Duolingo makes language learning simple, enjoyable, and rewarding every day.",
        "size": 135,
        "reviews": 14,
        "ratingAvg": 4.7,
        "downloads": 45,
        "ratings": [
            {
                "name": "1 star",
                "count": 250000
            },
            {
                "name": "2 star",
                "count": 350000
            },
            {
                "name": "3 star",
                "count": 800000
            },
            {
                "name": "4 star",
                "count": 2200000
            },
            {
                "name": "5 star",
                "count": 10600000
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/4gSpfn7t/Google-Maps.jpg",
        "title": "Google Maps",
        "companyName": "Google LLC",
        "id": 13,
        "description": "Google Maps is your ultimate navigation companion, offering detailed maps, real-time traffic updates, and turn-by-turn navigation. Whether you’re walking, driving, or using public transport, it provides accurate routes and estimated travel times. Users can explore restaurants, gas stations, landmarks, and nearby attractions. Street View and satellite imagery make virtual exploration easy. With offline maps, reviews, and local business info, Google Maps is essential for travelers and locals alike.",
        "description2": "Google Maps is the most trusted navigation and mapping app, guiding millions of users around the world with real-time traffic, transit, and route updates. It provides accurate directions for driving, walking, cycling, and public transport. Users can explore nearby restaurants, gas stations, and landmarks with ease. The app includes Street View, allowing virtual exploration of cities and neighborhoods. With live traffic alerts, it helps drivers avoid congestion and reach destinations faster. Google Maps also supports offline maps for areas without internet coverage. Businesses can register locations, display reviews, and attract local customers through Google Maps listings. The “Timeline” feature lets users track travel history, while saved places make trip planning easier. Whether commuting daily or exploring a new city, Google Maps combines precision, convenience, and reliability, making it an indispensable tool for navigation and discovery worldwide.",
        "size": 180,
        "reviews": 87,
        "ratingAvg": 4.7,
        "downloads": 60,
        "ratings": [
            {
                "name": "1 star",
                "count": 150000
            },
            {
                "name": "2 star",
                "count": 250000
            },
            {
                "name": "3 star",
                "count": 500000
            },
            {
                "name": "4 star",
                "count": 2000000
            },
            {
                "name": "5 star",
                "count": 5800000
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/LXDFfjbh/capcut.jpg",
        "title": "CapCut",
        "companyName": "Bytedance Pte. Ltd.",
        "id": 14,
        "description": "CapCut is a free all-in-one video editing app that makes it easy to create stunning videos. It offers advanced features like multi-layer editing, filters, slow motion, and auto captions. With trending templates, users can create professional-quality edits in minutes. CapCut supports HD export, background music, and seamless sharing to TikTok or Instagram. Whether you’re a beginner or pro, CapCut gives you everything needed to make cinematic content right on your phone.",
        "description2": "CapCut is a powerful all-in-one video editing app that enables users to create professional-quality videos directly from their smartphones. It offers advanced features like multi-layer editing, keyframe animation, background removal, and slow-motion effects—all with an easy-to-use interface. The app provides a vast library of transitions, sound effects, and royalty-free music to make every video dynamic. Its AI tools can automatically sync beats, enhance colors, and even generate captions for accessibility. CapCut also includes ready-made templates that simplify editing for social media platforms like TikTok, Instagram, and YouTube. Users can export videos in high definition up to 4K without watermarks. With built-in filters, text effects, and chroma key tools, creativity has no limits. Whether you’re a beginner making vlogs or a professional content creator, CapCut turns your ideas into cinematic, shareable videos effortlessly and efficiently.",
        "size": 150,
        "reviews": 72,
        "ratingAvg": 4.6,
        "downloads": 30,
        "ratings": [
            {
                "name": "1 star",
                "count": 100000
            },
            {
                "name": "2 star",
                "count": 150000
            },
            {
                "name": "3 star",
                "count": 300000
            },
            {
                "name": "4 star",
                "count": 1800000
            },
            {
                "name": "5 star",
                "count": 4800000
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/KjxyMYd5/amzon2.jpg",
        "title": "Amazon Shopping",
        "companyName": "Amazon Mobile LLC",
        "id": 15,
        "description": "Amazon Shopping offers millions of products across all categories, from electronics to clothing and groceries. Browse daily deals, compare prices, and enjoy one-click ordering with secure payments. Track your orders in real time and get personalized recommendations based on your shopping history. Amazon Prime members can enjoy fast delivery, exclusive offers, and access to Prime Video. The app’s sleek interface and 24/7 customer support make online shopping effortless.",
        "description2": "Amazon Shopping is the ultimate online marketplace where users can buy almost anything — from electronics and fashion to groceries and household essentials. The app offers secure payments, fast delivery, and personalized recommendations based on browsing habits. Its one-click purchasing and reliable customer service make shopping effortless. Amazon Prime members enjoy exclusive benefits like same-day delivery, Prime Video, and music streaming. Product reviews and ratings help users make informed decisions before purchasing. With advanced search filters, wishlists, and price alerts, shopping becomes more convenient than ever. The app also supports voice search through Alexa, enabling hands-free browsing and reordering. Amazon’s global reach ensures access to millions of products across every category. Whether you’re hunting for deals, tracking an order, or comparing brands, Amazon Shopping delivers a seamless, trusted, and satisfying e-commerce experience from your pocket.",
        "size": 280,
        "reviews": 11,
        "ratingAvg": 4.5,
        "downloads": 85,
        "ratings": [
            {
                "name": "1 star",
                "count": 200000
            },
            {
                "name": "2 star",
                "count": 300000
            },
            {
                "name": "3 star",
                "count": 800000
            },
            {
                "name": "4 star",
                "count": 3500000
            },
            {
                "name": "5 star",
                "count": 6900000
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/MDsZxWkj/Snapseed2.jpg",
        "title": "Snapseed",
        "companyName": "Google LLC",
        "id": 16,
        "description": "Snapseed is a professional photo editing app designed by Google that brings DSLR-level editing tools to your phone. It includes over 29 filters and effects, such as healing, brush, HDR, and perspective. The selective adjust feature lets you fine-tune specific areas of a photo, while RAW editing supports professional workflows. Its clean interface and non-destructive editing make Snapseed perfect for photographers of all levels.",
        "description2": "Snapseed, developed by Google, is a professional photo editing app that combines simplicity with powerful tools for precise image enhancement. It supports RAW and JPG formats, allowing for high-quality edits suitable for both hobbyists and professionals. The app features over 30 tools and filters, including HDR, Healing, Brush, and Selective Adjust, giving users full control over exposure, color, and texture. Its intuitive gesture-based interface makes editing fast and enjoyable. Snapseed’s “Tune Image” tool adjusts brightness, contrast, and saturation with pinpoint accuracy, while “Details” sharpens photos beautifully. Users can save custom presets for consistent editing styles across multiple images. With non-destructive editing, you can experiment freely and revert changes anytime. Whether refining portraits or enhancing landscapes, Snapseed delivers studio-grade editing power in your pocket—perfect for those who want professional results without complexity.",
        "size": 250,
        "reviews": 17,
        "ratingAvg": 4.6,
        "downloads": 15,
        "ratings": [
            {
                "name": "1 star",
                "count": 40000
            },
            {
                "name": "2 star",
                "count": 70000
            },
            {
                "name": "3 star",
                "count": 150000
            },
            {
                "name": "4 star",
                "count": 350000
            },
            {
                "name": "5 star",
                "count": 1180000
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/hFYYG1Ft/LinkedIn.jpg",
        "title": "LinkedIn",
        "companyName": "LinkedIn Corporation",
        "id": 17,
        "description": "LinkedIn is the world’s largest professional network connecting job seekers, recruiters, and professionals. Build your resume, showcase your skills, and apply to thousands of job opportunities worldwide. Stay updated with industry news, connect with colleagues, and grow your career with LinkedIn Learning. Businesses can also promote their brand, post jobs, and build strong professional communities — all in one platform.",
        "description2": "LinkedIn is the world’s largest professional networking platform, connecting millions of professionals, employers, and job seekers globally. It allows users to create detailed profiles showcasing skills, experience, and achievements. Through LinkedIn, professionals can apply for jobs, publish articles, and engage in meaningful industry discussions. The platform’s “Feed” keeps users updated on business trends and career insights. Employers use it for recruitment, while freelancers and entrepreneurs find valuable opportunities to grow their network. LinkedIn Learning provides skill-based courses on topics like leadership, coding, and marketing. The app also highlights mutual connections, helping users build trust and credibility. With real-time notifications, users can stay informed about profile views, job openings, and connection requests. Whether you’re a student, a business owner, or a corporate leader, LinkedIn helps you build your brand, learn continuously, and connect with opportunities that shape your professional future.",
        "size": 260,
        "reviews": 42,
        "ratingAvg": 4.4,
        "downloads": 40,
        "ratings": [
            {
                "name": "1 star",
                "count": 100000
            },
            {
                "name": "2 star",
                "count": 200000
            },
            {
                "name": "3 star",
                "count": 400000
            },
            {
                "name": "4 star",
                "count": 1200000
            },
            {
                "name": "5 star",
                "count": 2300000
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/JWDpMpwL/Zoom.jpg",
        "title": "Zoom Cloud Meetings",
        "companyName": "Zoom Video Communications, Inc.",
        "id": 18,
        "description": "Zoom is a top-rated video conferencing platform used by millions of professionals and educators worldwide. It enables virtual meetings, webinars, and classrooms with high-quality audio and video. You can share screens, record sessions, and use breakout rooms for collaboration. Zoom’s cross-platform compatibility and reliability make remote communication smooth and productive — whether for work, study, or social gatherings.",
        "description2": "Zoom is a leading video conferencing app used globally for meetings, webinars, and virtual events. It offers high-quality video, clear audio, and screen sharing that make collaboration effortless. The app supports hundreds of participants, with features like breakout rooms, recording, and live chat. Businesses, schools, and individuals rely on Zoom for remote communication, learning, and teamwork. Its user-friendly interface allows users to join meetings with a single link, even without an account. Zoom integrates with popular productivity tools like Slack, Google Calendar, and Microsoft Teams. The app’s virtual backgrounds, filters, and reactions make meetings more engaging. Security features like end-to-end encryption protect conversations. Whether attending online classes, hosting global conferences, or catching up with family, Zoom makes connecting easy and effective. Its stability, flexibility, and innovation have made it the go-to platform for modern communication.",
        "size": 295,
        "reviews": 65,
        "ratingAvg": 4.5,
        "downloads": 70,
        "ratings": [
            {
                "name": "1 star",
                "count": 150000
            },
            {
                "name": "2 star",
                "count": 200000
            },
            {
                "name": "3 star",
                "count": 400000
            },
            {
                "name": "4 star",
                "count": 1900000
            },
            {
                "name": "5 star",
                "count": 3850000
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/yB8NWnrk/Pinterest.jpg",
        "title": "Pinterest",
        "companyName": "Pinterest Inc.",
        "id": 19,
        "description": "Pinterest is a visual discovery engine where you can find inspiration for every project or interest. From home décor and fashion to recipes and travel ideas, it allows you to save and organize content on themed boards. Its recommendation system learns your taste and curates personalized ideas. Whether you’re planning a wedding, redecorating, or learning new DIY skills, Pinterest helps you turn creativity into reality.",
        "description2": "Pinterest is a visual discovery platform where creativity meets inspiration. It helps users find and organize ideas for everything from home décor and fashion to recipes and travel destinations. Each image, called a “Pin,” links to helpful resources, tutorials, or shopping pages. Pinterest’s smart search and recommendation system ensure that users always discover fresh, personalized ideas. Users can create themed boards to save and share collections for weddings, workouts, or DIY projects. The app also offers “Idea Pins” for creators who want to share stories or tutorials directly. Businesses use Pinterest for visual marketing, connecting their products to millions of interested viewers. Whether you’re redesigning a room or planning your next meal, Pinterest is like a digital vision board that sparks creativity every day. Its elegant interface and endless content make it the perfect place to explore inspiration without distractions.",
        "size": 370,
        "reviews": 73,
        "ratingAvg": 4.6,
        "downloads": 40,
        "ratings": [
            {
                "name": "1 star",
                "count": 80000
            },
            {
                "name": "2 star",
                "count": 130000
            },
            {
                "name": "3 star",
                "count": 200000
            },
            {
                "name": "4 star",
                "count": 1800000
            },
            {
                "name": "5 star",
                "count": 5200000
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/tMLdXqwX/Adobe-Lightroom.jpg",
        "title": "Adobe Lightroom",
        "companyName": "Adobe Inc.",
        "id": 20,
        "description": "Adobe Lightroom is a professional-grade photo editor that allows photographers to capture, edit, and share stunning images. It features advanced tools for exposure correction, color grading, and preset filters. You can sync your edits across mobile and desktop devices through Adobe Creative Cloud. Lightroom’s non-destructive editing workflow and intuitive sliders make it a must-have app for both hobbyists and professionals who demand perfection in every shot.",
        "description2": "Adobe Lightroom is a professional photo editing app designed to help photographers and creators bring their images to life with precision and creativity. It offers powerful tools for exposure, color correction, tone curves, and selective adjustments—all in a clean and intuitive interface. The app supports RAW photo editing, ensuring top-quality results even from professional cameras. Lightroom’s AI-powered features like “Auto Enhance” and “People Masking” save time while maintaining artistic control. Users can create and apply custom presets for consistent aesthetics across projects. Cloud synchronization keeps photos backed up and accessible from any device, including desktop. Lightroom also includes built-in tutorials for beginners and sharing options for instant portfolio showcasing. Whether you’re capturing nature, portraits, or lifestyle shots, Adobe Lightroom gives you full creative freedom to transform your photography into stunning works of art, wherever you are.",
        "size": 120,
        "reviews": 36,
        "ratingAvg": 4.7,
        "downloads": 30,
        "ratings": [
            {
                "name": "1 star",
                "count": 60000
            },
            {
                "name": "2 star",
                "count": 100000
            },
            {
                "name": "3 star",
                "count": 200000
            },
            {
                "name": "4 star",
                "count": 1000000
            },
            {
                "name": "5 star",
                "count": 2240000
            }
        ]
    }
]